---
type: BaseImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# BaseImportOptions

`Autodesk.Revit.DB.BaseImportOptions` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDefaultLengthUnit | 2022.1 | `public ForgeTypeId GetDefaultLengthUnit ()` |
| Method | GetLayerSelection | 2013 | `public ICollection < string > GetLayerSelection ()` |
| Method | SetDefaultLengthUnit | 2022.1 | `public void SetDefaultLengthUnit ( ForgeTypeId specTypeId )` |
| Method | SetLayerSelection | 2013 | `public void SetLayerSelection ( ICollection < string > layerSelection )` |
| Property | AutoCorrectAlmostVHLines | 2013 | `public bool AutoCorrectAlmostVHLines { get ; set ; }` |
| Property | ColorMode | 2013 | `public ImportColorMode ColorMode { get ; set ; }` |
| Property | CustomScale | 2013 | `public double CustomScale { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OrientToView | 2013 | `public bool OrientToView { get ; set ; }` |
| Property | Placement | 2013 | `public ImportPlacement Placement { get ; set ; }` |
| Property | ReferencePoint | 2013 | `public XYZ ReferencePoint { get ; set ; }` |
| Property | ThisViewOnly | 2013 | `public bool ThisViewOnly { get ; set ; }` |
| Property | Unit | 2013 | `public ImportUnit Unit { get ; set ; }` |
| Property | VisibleLayersOnly | 2013 | `public bool VisibleLayersOnly { get ; set ; }` |